app/views/users/show.html.erb

SELECT `sites`.* FROM `sites` WHERE `sites`.`user_id` = 1
---
          <tbody>
            <% @user.sites.each do |site| %>