app/views/tags/index.html.erb

  <tbody>
    <% @site.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`site_id` = 1