app/views/product_tags/index.html.erb

  <tbody>
    <% @product.product_tags.each do |product_tag| %>
---
SELECT `product_tags`.* FROM `product_tags` WHERE `product_tags`.`product_id` = 1

  <div class="field">
    <%= form.collection_select :tag_id, @site.tags.all, :id, :name %>
---
SELECT `tags`.* FROM `tags` WHERE `tags`.`site_id` = 1