app/controllers/product_tags_controller.rb

SELECT `product_tags`.* FROM `product_tags` WHERE `product_tags`.`product_id` = 1
---
  def index
    @product_tags = ProductTag.all

INSERT INTO `product_tags` (`tag_id`, `product_id`, `created_at`, `updated_at`) VALUES (1, 1, '2017-09-05 06:00:54', '2017-09-05 06:00:54')
---
  def create
    @product_tag = ProductTag.new(product_tag_params)

    respond_to do |format|
      if @product_tag.save

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 2 LIMIT 1
---
    def set_product_tag
      @product_tag = ProductTag.find(params[:id])

SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
    def set_site
      @site = Site.find(params[:site_id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params[:product_id])