app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    @site = product_params[:site_id]

    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`site_id`, `title`, `introduction`, `image_id`, `release_status`, `created_at`, `updated_at`) VALUES (1, 'feda', '', '88129380840aae7e4ab1f4b8158b8c50eeeb17eb5ae8e846a35bdd00b8a3', 0, '2017-09-06 01:32:12', '2017-09-06 01:32:12')

  def update
    @site = product_params[:site_id]
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE `products` SET `image_id` = '88129380840aae7e4ab1f4b8158b8c50eeeb17eb5ae8e846a35bdd00b8a3', `updated_at` = '2017-09-06 02:26:03' WHERE `products`.`id` = 1

  def destroy
    @product.destroy1
---
DELETE FROM `products` WHERE `products`.`id` = 1

    def set_site
      @site = Site.find(params[:site])
---
SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = NULL LIMIT 1