app/controllers/sites_controller.rb

  def index
    @sites = Site.all
---
SELECT `sites`.* FROM `sites`

  def show
    @products = @site.products.where(release_status: true).take(6)
    @tags = @site.tags.all
---
SELECT `products`.* FROM `products` WHERE `products`.`site_id` = 1 AND `products`.`release_status` = 1
SELECT `products`.* FROM `products` WHERE `products`.`site_id` = 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`site_id` = 1

  def create
    @site = Site.new(site_params)

    respond_to do |format|
      if @site.save
---
INSERT INTO `sites` (`user_id`, `name`, `caption`, `release_status`, `created_at`, `updated_at`) VALUES (1, 'first', 'first', 1, '2017-09-04 02:41:24', '2017-09-04 02:41:24')

  def destroy
    @site.destroy
---
DELETE FROM `sites` WHERE `sites`.`id` = 2

    def set_site
      @site = Site.find(params[:id])
---
SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = NULL LIMIT 1