app/controllers/tags_controller.rb

SELECT `tags`.* FROM `tags`
---
  def index
    @tag = Tag.new
    @tags = Tag.all

INSERT INTO `tags` (`site_id`, `name`, `created_at`, `updated_at`) VALUES (1, 'afds', '2017-09-05 05:03:07', '2017-09-05 05:03:07')
---
  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save

DELETE FROM `tags` WHERE `tags`.`id` = 1
---
  def destroy
    @tag.destroy

SELECT  `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
    def set_tag
      @tag = Tag.find(params[:id])

SELECT  `sites`.* FROM `sites` WHERE `sites`.`id` = 1 LIMIT 1
---
    def set_site
      @site = Site.find(params[:site])