app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('example.com', '$2a$10$j44Xg3tTnU2egsimRQ5.HuBNKNEv.bjTgBrW95fXait0eEP73.hD2', 'oJVtVZrdCMWDgCaAyuat', '2017-08-29 19:20:38', '2017-08-29 19:20:38')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save